tangyangguang/Esp32Base/src/core/Esp32BaseConfig.cpp
#include "Esp32BaseConfig.h"

#include "../Esp32BaseProfile.h"
#include "Esp32BaseLog.h"
#include "Esp32BaseUtil.h"
#include "internal/Esp32BaseConfigInternal.h"

#include <Preferences.h>
#include <nvs.h>
#include <stdlib.h>
#include <string.h>

namespace {
constexpr size_t CONFIG_STRING_MAX_VISIBLE_LEN = 3999;

enum PendingType : uint8_t {
    PENDING_EMPTY = 0,
    PENDING_INT,
    PENDING_BOOL,
    PENDING_STR,
    PENDING_BLOB
};

struct PendingItem {
    PendingType type;
    char ns[16];
    char key[16];
    char* strValue;
    uint8_t* blobValue;
    size_t blobLen;
    int32_t intValue;
    bool boolValue;
    uint32_t dueMs;
};

bool g_ready = false;
bool g_paused = false;
bool g_auditEnabled = false;
bool g_readAuditEnabled = false;
PendingItem g_pending[ESP32BASE_CONFIG_PENDING_MAX];
uint8_t g_blobScratch[Esp32BaseConfig::CONFIG_BLOB_MAX_LEN];

bool validName(const char* value) {
    if (!value) {
        return false;
    }
    const size_t len = strlen(value);
    return len >= 1 && len <= 15;
}

enum class NamespaceLookupResult : uint8_t {
    Found,
    NotFound,
    Error
};

NamespaceLookupResult lookupNamespace(const char* ns) {
    if (!validName(ns)) {
        return NamespaceLookupResult::Error;
    }
    nvs_handle_t handle = 0;
    const esp_err_t err = nvs_open(ns, NVS_READONLY, &handle);
    if (err == ESP_OK) {
        nvs_close(handle);
        return NamespaceLookupResult::Found;
    }
    return err == ESP_ERR_NVS_NOT_FOUND
               ? NamespaceLookupResult::NotFound
               : NamespaceLookupResult::Error;
}

bool namespaceExists(const char* ns) {
    return lookupNamespace(ns) == NamespaceLookupResult::Found;
}

bool readStoredString(const char* ns, const char* key, char* out, size_t len, bool* found) {
    if (found) {
        *found = false;
    }
    if (!out || len == 0) {
        return false;
    }
    out[0] = '\0';

    nvs_handle_t handle = 0;
    const esp_err_t openErr = nvs_open(ns, NVS_READONLY, &handle);
    if (openErr == ESP_ERR_NVS_NOT_FOUND) {
        return true;
    }
    if (openErr != ESP_OK) {
        return false;
    }

    size_t required = 0;
    esp_err_t err = nvs_get_str(handle, key, nullptr, &required);
    if (err == ESP_ERR_NVS_NOT_FOUND) {
        nvs_close(handle);
        return true;
    }
    if (err != ESP_OK || required == 0 || required > CONFIG_STRING_MAX_VISIBLE_LEN + 1U) {
        nvs_close(handle);
        return false;
    }

    char* readBuffer = out;
    if (required > len) {
        readBuffer = static_cast<char*>(malloc(required));
        if (!readBuffer) {
            nvs_close(handle);
            return false;
        }
    }
    size_t readLength = required;
    err = nvs_get_str(handle, key, readBuffer, &readLength);
    nvs_close(handle);
    if (err != ESP_OK) {
        if (readBuffer != out) {
            free(readBuffer);
        }
        out[0] = '\0';
        return false;
    }
    if (readBuffer != out) {
        esp32base_internal::copySafe(out, len, readBuffer);
        free(readBuffer);
    }
    if (found) {
        *found = true;
    }
    return true;
}

enum class StoredStringCompareResult : uint8_t {
    NotFound,
    Equal,
    Different,
    Error
};

StoredStringCompareResult compareStoredString(const char* ns, const char* key,
                                              const char* value) {
    if (!value) {
        return StoredStringCompareResult::Error;
    }

    nvs_handle_t handle = 0;
    const esp_err_t openErr = nvs_open(ns, NVS_READONLY, &handle);
    if (openErr == ESP_ERR_NVS_NOT_FOUND) {
        return StoredStringCompareResult::NotFound;
    }
    if (openErr != ESP_OK) {
        return StoredStringCompareResult::Error;
    }

    size_t required = 0;
    esp_err_t err = nvs_get_str(handle, key, nullptr, &required);
    if (err == ESP_ERR_NVS_NOT_FOUND) {
        nvs_close(handle);
        return StoredStringCompareResult::NotFound;
    }
    if (err == ESP_ERR_NVS_TYPE_MISMATCH) {
        nvs_close(handle);
        return StoredStringCompareResult::Different;
    }
    if (err != ESP_OK || required == 0 || required > CONFIG_STRING_MAX_VISIBLE_LEN + 1U) {
        nvs_close(handle);
        return StoredStringCompareResult::Error;
    }
    if (required != strlen(value) + 1U) {
        nvs_close(handle);
        return StoredStringCompareResult::Different;
    }

    char* readBuffer = required <= sizeof(g_blobScratch)
        ? reinterpret_cast<char*>(g_blobScratch)
        : static_cast<char*>(malloc(required));
    if (!readBuffer) {
        nvs_close(handle);
        return StoredStringCompareResult::Error;
    }
    size_t readLength = required;
    err = nvs_get_str(handle, key, readBuffer, &readLength);
    nvs_close(handle);
    const StoredStringCompareResult result =
        err == ESP_OK
            ? (strcmp(readBuffer, value) == 0
                   ? StoredStringCompareResult::Equal
                   : StoredStringCompareResult::Different)
            : StoredStringCompareResult::Error;
    if (readBuffer != reinterpret_cast<char*>(g_blobScratch)) {
        free(readBuffer);
    }
    return result;
}

bool readStoredBlob(const char* ns, const char* key, void* out, size_t len, size_t* actualLen, bool* found) {
    if (actualLen) {
        *actualLen = 0;
    }
    if (found) {
        *found = false;
    }
    if (!out || len == 0 || len > Esp32BaseConfig::CONFIG_BLOB_MAX_LEN) {
        return false;
    }

    nvs_handle_t handle = 0;
    const esp_err_t openErr = nvs_open(ns, NVS_READONLY, &handle);
    if (openErr == ESP_ERR_NVS_NOT_FOUND) {
        return true;
    }
    if (openErr != ESP_OK) {
        return false;
    }

    size_t required = 0;
    esp_err_t err = nvs_get_blob(handle, key, nullptr, &required);
    if (err == ESP_ERR_NVS_NOT_FOUND) {
        nvs_close(handle);
        return true;
    }
    if (err != ESP_OK || required == 0 || required > len || required > Esp32BaseConfig::CONFIG_BLOB_MAX_LEN) {
        nvs_close(handle);
        return false;
    }

    err = nvs_get_blob(handle, key, out, &required);
    nvs_close(handle);
    if (err != ESP_OK) {
        return false;
    }
    if (actualLen) {
        *actualLen = required;
    }
    if (found) {
        *found = true;
    }
    return true;
}

bool readStoredInt(const char* ns, const char* key, int32_t* out, bool* found) {
    if (found) {
        *found = false;
    }
    if (!out) {
        return false;
    }
    nvs_handle_t handle = 0;
    const esp_err_t openErr = nvs_open(ns, NVS_READONLY, &handle);
    if (openErr == ESP_ERR_NVS_NOT_FOUND) {
        return true;
    }
    if (openErr != ESP_OK) {
        return false;
    }

    int32_t value = 0;
    const esp_err_t err = nvs_get_i32(handle, key, &value);
    nvs_close(handle);
    if (err == ESP_ERR_NVS_NOT_FOUND) {
        return true;
    }
    if (err != ESP_OK) {
        return false;
    }
    *out = value;
    if (found) {
        *found = true;
    }
    return true;
}

bool readStoredBool(const char* ns, const char* key, bool* out, bool* found) {
    if (found) {
        *found = false;
    }
    if (!out) {
        return false;
    }
    nvs_handle_t handle = 0;
    const esp_err_t openErr = nvs_open(ns, NVS_READONLY, &handle);
    if (openErr == ESP_ERR_NVS_NOT_FOUND) {
        return true;
    }
    if (openErr != ESP_OK) {
        return false;
    }

    uint8_t value = 0;
    const esp_err_t err = nvs_get_u8(handle, key, &value);
    nvs_close(handle);
    if (err == ESP_ERR_NVS_NOT_FOUND) {
        return true;
    }
    if (err != ESP_OK) {
        return false;
    }
    *out = value != 0;
    if (found) {
        *found = true;
    }
    return true;
}

