tangyangguang/Esp32Base/src/core/Esp32BaseConfig.cpp
int findPending(const char* ns, const char* key) {
    for (uint8_t i = 0; i < ESP32BASE_CONFIG_PENDING_MAX; ++i) {
        if (g_pending[i].type != PENDING_EMPTY && strcmp(g_pending[i].ns, ns) == 0 && strcmp(g_pending[i].key, key) == 0) {
            return i;
        }
    }
    return -1;
}

int allocPending(const char* ns, const char* key) {
    const int existing = findPending(ns, key);
    if (existing >= 0) {
        return existing;
    }
    for (uint8_t i = 0; i < ESP32BASE_CONFIG_PENDING_MAX; ++i) {
        if (g_pending[i].type == PENDING_EMPTY) {
            esp32base_internal::copySafe(g_pending[i].ns, sizeof(g_pending[i].ns), ns);
            esp32base_internal::copySafe(g_pending[i].key, sizeof(g_pending[i].key), key);
            return i;
        }
    }
    return -1;
}

void clearPendingString(PendingItem& item) {
    if (item.type == PENDING_STR && item.strValue) {
        free(item.strValue);
        item.strValue = nullptr;
    }
}

void clearPendingBlob(PendingItem& item) {
    if (item.type == PENDING_BLOB && item.blobValue) {
        free(item.blobValue);
        item.blobValue = nullptr;
    }
    item.blobLen = 0;
}

void clearPendingItem(PendingItem& item) {
    clearPendingString(item);
    clearPendingBlob(item);
    item.type = PENDING_EMPTY;
    item.ns[0] = '\0';
    item.key[0] = '\0';
}

void clearPendingKey(const char* ns, const char* key) {
    const int pending = findPending(ns, key);
    if (pending >= 0) {
        clearPendingItem(g_pending[pending]);
    }
}

void clearPendingNamespace(const char* ns) {
    for (uint8_t i = 0; i < ESP32BASE_CONFIG_PENDING_MAX; ++i) {
        if (g_pending[i].type != PENDING_EMPTY && strcmp(g_pending[i].ns, ns) == 0) {
            clearPendingItem(g_pending[i]);
        }
    }
}

bool writePending(PendingItem& item) {
    Preferences prefs;
    if (!prefs.begin(item.ns, false)) {
        return false;
    }

    bool ok = false;
    switch (item.type) {
        case PENDING_INT:
            ok = prefs.putInt(item.key, item.intValue) > 0;
            break;
        case PENDING_BOOL:
            ok = prefs.putBool(item.key, item.boolValue) > 0;
            break;
        case PENDING_STR:
            {
                const char* value = item.strValue ? item.strValue : "";
                const size_t written = prefs.putString(item.key, value);
                ok = value[0] == '\0' ? prefs.isKey(item.key) : written > 0;
            }
            break;
        case PENDING_BLOB:
            ok = item.blobValue && item.blobLen > 0 && prefs.putBytes(item.key, item.blobValue, item.blobLen) == item.blobLen;
            break;
        default:
            ok = true;
            break;
    }
    prefs.end();
    if (g_auditEnabled) {
        if (ok) {
            ESP32BASE_LOG_I("config", "audit op=flush ns=%s key=%s type=%u result=success",
                            item.ns, item.key, static_cast<unsigned>(item.type));
        } else {
            ESP32BASE_LOG_W("config", "audit op=flush ns=%s key=%s type=%u result=failed",
                            item.ns, item.key, static_cast<unsigned>(item.type));
        }
    }
    return ok;
}

bool flushIndex(uint8_t index) {
    if (index >= ESP32BASE_CONFIG_PENDING_MAX || g_pending[index].type == PENDING_EMPTY) {
        return false;
    }
    if (!writePending(g_pending[index])) {
        ESP32BASE_LOG_E("config", "deferred flush failed: %s.%s", g_pending[index].ns, g_pending[index].key);
        return false;
    }
    clearPendingItem(g_pending[index]);
    return true;
}
}

esp32base_internal::ConfigUInt32ReadResult esp32base_internal::readConfigUInt32(
    const char* ns,
    const char* key,
    uint32_t& value) {
    if (!validName(ns) || !validName(key)) {
        return ConfigUInt32ReadResult::Error;
    }
    nvs_handle_t handle = 0;
    const esp_err_t openErr = nvs_open(ns, NVS_READONLY, &handle);
    if (openErr == ESP_ERR_NVS_NOT_FOUND) {
        value = 0;
        return ConfigUInt32ReadResult::NotFound;
    }
    if (openErr != ESP_OK) {
        return ConfigUInt32ReadResult::Error;
    }
    const esp_err_t readErr = nvs_get_u32(handle, key, &value);
    nvs_close(handle);
    if (readErr == ESP_ERR_NVS_NOT_FOUND) {
        value = 0;
        return ConfigUInt32ReadResult::NotFound;
    }
    return readErr == ESP_OK ? ConfigUInt32ReadResult::Found
                             : ConfigUInt32ReadResult::Error;
}

bool esp32base_internal::writeConfigUInt32(const char* ns, const char* key, uint32_t value) {
    if (!validName(ns) || !validName(key)) {
        return false;
    }
    uint32_t storedValue = 0;
    const ConfigUInt32ReadResult readResult = readConfigUInt32(ns, key, storedValue);
    if (readResult == ConfigUInt32ReadResult::Found && storedValue == value) {
        return true;
    }
    Preferences prefs;
    if (!prefs.begin(ns, false)) {
        return false;
    }
    const bool ok = prefs.putUInt(key, value) > 0;
    prefs.end();
    return ok;
}

esp32base_internal::ConfigKeyRemoveResult esp32base_internal::removeConfigKey(const char* ns, const char* key) {
    if (!validName(ns) || !validName(key)) {
        return ConfigKeyRemoveResult::Error;
    }
    const bool hadPending = findPending(ns, key) >= 0;
    const NamespaceLookupResult lookup = lookupNamespace(ns);
    if (lookup == NamespaceLookupResult::Error) {
        return ConfigKeyRemoveResult::Error;
    }
    if (lookup == NamespaceLookupResult::NotFound) {
        clearPendingKey(ns, key);
        return hadPending ? ConfigKeyRemoveResult::Removed : ConfigKeyRemoveResult::NotFound;
    }
    Preferences prefs;
    if (!prefs.begin(ns, false)) {
        return ConfigKeyRemoveResult::Error;
    }
    const bool existed = prefs.isKey(key);
    const bool ok = !existed || prefs.remove(key);
    prefs.end();
    if (!ok) {
        return ConfigKeyRemoveResult::Error;
    }
    clearPendingKey(ns, key);
    return existed || hadPending ? ConfigKeyRemoveResult::Removed : ConfigKeyRemoveResult::NotFound;
}

