tangyangguang/Esp32Base/src/core/Esp32BaseConfig.cpp
bool Esp32BaseConfig::begin() {
    g_ready = true;
    return true;
}

void Esp32BaseConfig::handle() {
    flushNextDue();
}

bool Esp32BaseConfig::isReady() {
    return g_ready;
}

bool Esp32BaseConfig::setStr(const char* ns, const char* key, const char* value) {
    if (!validName(ns) || !validName(key) || !value || strlen(value) > CONFIG_STRING_MAX_VISIBLE_LEN) {
        return false;
    }
    const StoredStringCompareResult compareResult =
        compareStoredString(ns, key, value);
    if (compareResult == StoredStringCompareResult::Equal) {
        if (g_auditEnabled) {
            ESP32BASE_LOG_D("config", "audit op=setStr ns=%s key=%s changed=no result=skipped", ns, key);
        }
        clearPendingKey(ns, key);
        return true;
    }
    if (compareResult == StoredStringCompareResult::Error) {
        ESP32BASE_LOG_W("config", "audit op=setStr ns=%s key=%s result=compare_failed", ns, key);
        return false;
    }

    Preferences prefs;
    if (!prefs.begin(ns, false)) {
        return false;
    }
    const size_t written = prefs.putString(key, value);
    const bool ok = value[0] == '\0' ? prefs.isKey(key) : written > 0;
    prefs.end();
    if (!ok) {
        ESP32BASE_LOG_W("config", "audit op=setStr ns=%s key=%s changed=yes result=failed", ns, key);
    } else if (g_auditEnabled) {
        ESP32BASE_LOG_I("config", "audit op=setStr ns=%s key=%s changed=yes result=%s", ns, key, ok ? "success" : "failed");
    }
    if (ok) {
        clearPendingKey(ns, key);
    }
    return ok;
}

bool Esp32BaseConfig::getStr(const char* ns, const char* key, char* out, size_t len, const char* def) {
    if (!out || len == 0 || !validName(ns) || !validName(key)) {
        return false;
    }

    const int pending = findPending(ns, key);
    if (pending >= 0 && g_pending[pending].type == PENDING_STR) {
        esp32base_internal::copySafe(out, len, g_pending[pending].strValue ? g_pending[pending].strValue : "");
        return true;
    }

    bool found = false;
    if (!readStoredString(ns, key, out, len, &found)) {
        esp32base_internal::copySafe(out, len, def ? def : "");
        return false;
    }
    if (!found) {
        esp32base_internal::copySafe(out, len, def ? def : "");
    }
    if (g_readAuditEnabled) {
        ESP32BASE_LOG_D("config", "audit op=getStr ns=%s key=%s found=%s value=%s", ns, key, found ? "yes" : "no", out);
    }
    return found;
}

bool Esp32BaseConfig::setInt(const char* ns, const char* key, int32_t value) {
    if (!validName(ns) || !validName(key)) {
        return false;
    }
    Preferences prefs;
    if (!prefs.begin(ns, false)) {
        return false;
    }
    const bool hadOld = prefs.isKey(key);
    if (hadOld && prefs.getInt(key, value) == value) {
        prefs.end();
        if (g_auditEnabled) {
            ESP32BASE_LOG_D("config", "audit op=setInt ns=%s key=%s changed=no result=skipped", ns, key);
        }
        clearPendingKey(ns, key);
        return true;
    }
    const bool ok = prefs.putInt(key, value) > 0;
    prefs.end();
    if (!ok) {
        ESP32BASE_LOG_W("config", "audit op=setInt ns=%s key=%s changed=yes value=%ld result=failed",
                        ns, key, static_cast<long>(value));
    } else if (g_auditEnabled) {
        ESP32BASE_LOG_I("config", "audit op=setInt ns=%s key=%s changed=yes value=%ld result=%s",
                        ns, key, static_cast<long>(value), ok ? "success" : "failed");
    }
    if (ok) {
        clearPendingKey(ns, key);
    }
    return ok;
}

int32_t Esp32BaseConfig::getInt(const char* ns, const char* key, int32_t def) {
    if (!validName(ns) || !validName(key)) {
        return def;
    }
    const int pending = findPending(ns, key);
    if (pending >= 0 && g_pending[pending].type == PENDING_INT) {
        return g_pending[pending].intValue;
    }
    if (!namespaceExists(ns)) {
        return def;
    }
    Preferences prefs;
    if (!prefs.begin(ns, true)) {
        return def;
    }
    const bool found = prefs.isKey(key);
    const int32_t value = found ? prefs.getInt(key, def) : def;
    prefs.end();
    if (g_readAuditEnabled) {
        ESP32BASE_LOG_D("config", "audit op=getInt ns=%s key=%s found=%s value=%ld",
                        ns, key, found ? "yes" : "no", static_cast<long>(value));
    }
    return value;
}

bool Esp32BaseConfig::setIntDeferred(const char* ns, const char* key, int32_t value, uint32_t delayMs) {
    if (!validName(ns) || !validName(key)) {
        return false;
    }
    const int existing = findPending(ns, key);
    if (existing >= 0 && g_pending[existing].type == PENDING_INT && g_pending[existing].intValue == value) {
        if (g_auditEnabled) {
            ESP32BASE_LOG_D("config", "audit op=setIntDeferred ns=%s key=%s value=%ld changed=no result=skipped_pending",
                            ns, key, static_cast<long>(value));
        }
        return true;
    }

    bool hadOld = false;
    int32_t oldValue = 0;
    const bool readOk = readStoredInt(ns, key, &oldValue, &hadOld);
    if (readOk && hadOld && oldValue == value) {
        if (g_auditEnabled) {
            ESP32BASE_LOG_D("config", "audit op=setIntDeferred ns=%s key=%s value=%ld changed=no result=skipped",
                            ns, key, static_cast<long>(value));
        }
        clearPendingKey(ns, key);
        return true;
    }

    const int slot = allocPending(ns, key);
    if (slot < 0) {
        return false;
    }
    clearPendingString(g_pending[slot]);
    clearPendingBlob(g_pending[slot]);
    g_pending[slot].type = PENDING_INT;
    g_pending[slot].intValue = value;
    g_pending[slot].dueMs = millis() + delayMs;
    if (g_auditEnabled) {
        ESP32BASE_LOG_D("config", "audit op=setIntDeferred ns=%s key=%s value=%ld", ns, key, static_cast<long>(value));
    }
    return true;
}

bool Esp32BaseConfig::setBool(const char* ns, const char* key, bool value) {
    if (!validName(ns) || !validName(key)) {
        return false;
    }
    Preferences prefs;
    if (!prefs.begin(ns, false)) {
        return false;
    }
    const bool hadOld = prefs.isKey(key);
    if (hadOld && prefs.getBool(key, value) == value) {
        prefs.end();
        if (g_auditEnabled) {
            ESP32BASE_LOG_D("config", "audit op=setBool ns=%s key=%s changed=no result=skipped", ns, key);
        }
        clearPendingKey(ns, key);
        return true;
    }
    const bool ok = prefs.putBool(key, value) > 0;
    prefs.end();
    if (!ok) {
        ESP32BASE_LOG_W("config", "audit op=setBool ns=%s key=%s changed=yes value=%u result=failed",
                        ns, key, value ? 1U : 0U);
    } else if (g_auditEnabled) {
        ESP32BASE_LOG_I("config", "audit op=setBool ns=%s key=%s changed=yes value=%u result=%s",
                        ns, key, value ? 1U : 0U, ok ? "success" : "failed");
    }
    if (ok) {
        clearPendingKey(ns, key);
    }
    return ok;
}

