tangyangguang/Esp32Base/src/core/Esp32BaseConfig.cpp
bool Esp32BaseConfig::getBool(const char* ns, const char* key, bool def) {
    if (!validName(ns) || !validName(key)) {
        return def;
    }
    const int pending = findPending(ns, key);
    if (pending >= 0 && g_pending[pending].type == PENDING_BOOL) {
        return g_pending[pending].boolValue;
    }
    if (!namespaceExists(ns)) {
        return def;
    }
    Preferences prefs;
    if (!prefs.begin(ns, true)) {
        return def;
    }
    const bool found = prefs.isKey(key);
    const bool value = found ? prefs.getBool(key, def) : def;
    prefs.end();
    if (g_readAuditEnabled) {
        ESP32BASE_LOG_D("config", "audit op=getBool ns=%s key=%s found=%s value=%u",
                        ns, key, found ? "yes" : "no", value ? 1U : 0U);
    }
    return value;
}

bool Esp32BaseConfig::setBoolDeferred(const char* ns, const char* key, bool value, uint32_t delayMs) {
    if (!validName(ns) || !validName(key)) {
        return false;
    }
    const int existing = findPending(ns, key);
    if (existing >= 0 && g_pending[existing].type == PENDING_BOOL && g_pending[existing].boolValue == value) {
        if (g_auditEnabled) {
            ESP32BASE_LOG_D("config", "audit op=setBoolDeferred ns=%s key=%s value=%u changed=no result=skipped_pending",
                            ns, key, value ? 1U : 0U);
        }
        return true;
    }

    bool hadOld = false;
    bool oldValue = false;
    const bool readOk = readStoredBool(ns, key, &oldValue, &hadOld);
    if (readOk && hadOld && oldValue == value) {
        if (g_auditEnabled) {
            ESP32BASE_LOG_D("config", "audit op=setBoolDeferred ns=%s key=%s value=%u changed=no result=skipped",
                            ns, key, value ? 1U : 0U);
        }
        clearPendingKey(ns, key);
        return true;
    }

    const int slot = allocPending(ns, key);
    if (slot < 0) {
        return false;
    }
    clearPendingString(g_pending[slot]);
    clearPendingBlob(g_pending[slot]);
    g_pending[slot].type = PENDING_BOOL;
    g_pending[slot].boolValue = value;
    g_pending[slot].dueMs = millis() + delayMs;
    if (g_auditEnabled) {
        ESP32BASE_LOG_D("config", "audit op=setBoolDeferred ns=%s key=%s value=%u", ns, key, value ? 1U : 0U);
    }
    return true;
}

bool Esp32BaseConfig::setStrDeferred(const char* ns, const char* key, const char* value, uint32_t delayMs) {
    if (!validName(ns) || !validName(key) || !value || strlen(value) > 3999) {
        return false;
    }
    const size_t valueLen = strlen(value);
    const int existing = findPending(ns, key);
    if (existing >= 0 && g_pending[existing].type == PENDING_STR &&
        strcmp(g_pending[existing].strValue ? g_pending[existing].strValue : "", value) == 0) {
        if (g_auditEnabled) {
            char lenBuf[24];
            Esp32BaseLog::formatBytes(valueLen, lenBuf, sizeof(lenBuf));
            ESP32BASE_LOG_D("config", "audit op=setStrDeferred ns=%s key=%s len=%s changed=no result=skipped_pending",
                            ns, key, lenBuf);
        }
        return true;
    }

    const StoredStringCompareResult compareResult =
        compareStoredString(ns, key, value);
    if (compareResult == StoredStringCompareResult::Equal) {
        if (g_auditEnabled) {
            char lenBuf[24];
            Esp32BaseLog::formatBytes(valueLen, lenBuf, sizeof(lenBuf));
            ESP32BASE_LOG_D("config", "audit op=setStrDeferred ns=%s key=%s len=%s changed=no result=skipped",
                            ns, key, lenBuf);
        }
        clearPendingKey(ns, key);
        return true;
    }
    if (compareResult == StoredStringCompareResult::Error) {
        ESP32BASE_LOG_W("config",
                        "audit op=setStrDeferred ns=%s key=%s result=compare_failed",
                        ns, key);
        return false;
    }

    const int slot = allocPending(ns, key);
    if (slot < 0) {
        return false;
    }
    char* copy = static_cast<char*>(malloc(valueLen + 1));
    if (!copy) {
        return false;
    }
    memcpy(copy, value, valueLen + 1);
    clearPendingString(g_pending[slot]);
    clearPendingBlob(g_pending[slot]);
    g_pending[slot].type = PENDING_STR;
    g_pending[slot].strValue = copy;
    g_pending[slot].dueMs = millis() + delayMs;
    if (g_auditEnabled) {
        char lenBuf[24];
        Esp32BaseLog::formatBytes(valueLen, lenBuf, sizeof(lenBuf));
        ESP32BASE_LOG_D("config", "audit op=setStrDeferred ns=%s key=%s len=%s", ns, key, lenBuf);
    }
    return true;
}

bool Esp32BaseConfig::setBlob(const char* ns, const char* key, const void* data, size_t len) {
    if (!validName(ns) || !validName(key) || !data || len == 0 || len > CONFIG_BLOB_MAX_LEN) {
        return false;
    }
    bool hadOld = false;
    size_t oldLen = 0;
    const bool readOk = readStoredBlob(ns, key, g_blobScratch, sizeof(g_blobScratch), &oldLen, &hadOld);
    if (readOk && hadOld && oldLen == len && memcmp(g_blobScratch, data, len) == 0) {
        if (g_auditEnabled) {
            char lenBuf[24];
            Esp32BaseLog::formatBytes(len, lenBuf, sizeof(lenBuf));
            ESP32BASE_LOG_D("config", "audit op=setBlob ns=%s key=%s len=%s changed=no result=skipped",
                            ns, key, lenBuf);
        }
        clearPendingKey(ns, key);
        return true;
    }

    Preferences prefs;
    if (!prefs.begin(ns, false)) {
        return false;
    }
    const bool ok = prefs.putBytes(key, data, len) == len;
    prefs.end();
    if (!ok) {
        char lenBuf[24];
        Esp32BaseLog::formatBytes(len, lenBuf, sizeof(lenBuf));
        ESP32BASE_LOG_W("config", "audit op=setBlob ns=%s key=%s len=%s changed=yes result=failed",
                        ns, key, lenBuf);
    } else if (g_auditEnabled) {
        char lenBuf[24];
        Esp32BaseLog::formatBytes(len, lenBuf, sizeof(lenBuf));
        ESP32BASE_LOG_I("config", "audit op=setBlob ns=%s key=%s len=%s changed=yes result=success",
                        ns, key, lenBuf);
    }
    if (ok) {
        clearPendingKey(ns, key);
    }
    return ok;
}

