tangyangguang/Esp32Base/src/core/Esp32BaseConfig.cpp
bool Esp32BaseConfig::getBlob(const char* ns, const char* key, void* out, size_t len) {
    return readBlob(ns, key, out, len) == BlobReadResult::Found;
}

Esp32BaseConfig::BlobReadResult Esp32BaseConfig::readBlob(const char* ns, const char* key, void* out, size_t len) {
    if (!validName(ns) || !validName(key) || !out || len == 0 || len > CONFIG_BLOB_MAX_LEN) {
        return BlobReadResult::Error;
    }

    const int pending = findPending(ns, key);
    if (pending >= 0 && g_pending[pending].type == PENDING_BLOB) {
        if (g_pending[pending].blobLen != len || !g_pending[pending].blobValue) {
            return BlobReadResult::Error;
        }
        memcpy(out, g_pending[pending].blobValue, len);
        return BlobReadResult::Found;
    }

    bool found = false;
    size_t actualLen = 0;
    const bool ok = readStoredBlob(ns, key, out, len, &actualLen, &found);
    if (g_readAuditEnabled) {
        char lenBuf[24];
        Esp32BaseLog::formatBytes(actualLen, lenBuf, sizeof(lenBuf));
        ESP32BASE_LOG_D("config", "audit op=getBlob ns=%s key=%s found=%s len=%s",
                        ns, key, found ? "yes" : "no", lenBuf);
    }
    if (!ok) return BlobReadResult::Error;
    if (!found) return BlobReadResult::NotFound;
    return actualLen == len ? BlobReadResult::Found : BlobReadResult::Error;
}

bool Esp32BaseConfig::setBlobDeferred(const char* ns, const char* key, const void* data, size_t len, uint32_t delayMs) {
    if (!validName(ns) || !validName(key) || !data || len == 0 || len > CONFIG_BLOB_MAX_LEN) {
        return false;
    }
    const int existing = findPending(ns, key);
    if (existing >= 0 && g_pending[existing].type == PENDING_BLOB && g_pending[existing].blobLen == len &&
        g_pending[existing].blobValue && memcmp(g_pending[existing].blobValue, data, len) == 0) {
        if (g_auditEnabled) {
            char lenBuf[24];
            Esp32BaseLog::formatBytes(len, lenBuf, sizeof(lenBuf));
            ESP32BASE_LOG_D("config", "audit op=setBlobDeferred ns=%s key=%s len=%s changed=no result=skipped_pending",
                            ns, key, lenBuf);
        }
        return true;
    }

    bool hadOld = false;
    size_t oldLen = 0;
    const bool readOk = readStoredBlob(ns, key, g_blobScratch, sizeof(g_blobScratch), &oldLen, &hadOld);
    if (readOk && hadOld && oldLen == len && memcmp(g_blobScratch, data, len) == 0) {
        if (g_auditEnabled) {
            char lenBuf[24];
            Esp32BaseLog::formatBytes(len, lenBuf, sizeof(lenBuf));
            ESP32BASE_LOG_D("config", "audit op=setBlobDeferred ns=%s key=%s len=%s changed=no result=skipped",
                            ns, key, lenBuf);
        }
        clearPendingKey(ns, key);
        return true;
    }

    const int slot = allocPending(ns, key);
    if (slot < 0) {
        return false;
    }
    uint8_t* copy = static_cast<uint8_t*>(malloc(len));
    if (!copy) {
        return false;
    }
    memcpy(copy, data, len);
    clearPendingString(g_pending[slot]);
    clearPendingBlob(g_pending[slot]);
    g_pending[slot].type = PENDING_BLOB;
    g_pending[slot].blobValue = copy;
    g_pending[slot].blobLen = len;
    g_pending[slot].dueMs = millis() + delayMs;
    if (g_auditEnabled) {
        char lenBuf[24];
        Esp32BaseLog::formatBytes(len, lenBuf, sizeof(lenBuf));
        ESP32BASE_LOG_D("config", "audit op=setBlobDeferred ns=%s key=%s len=%s",
                        ns, key, lenBuf);
    }
    return true;
}

bool Esp32BaseConfig::flushNextDue() {
    if (g_paused) {
        return false;
    }
    const uint32_t now = millis();
    for (uint8_t i = 0; i < ESP32BASE_CONFIG_PENDING_MAX; ++i) {
        if (g_pending[i].type != PENDING_EMPTY && static_cast<int32_t>(now - g_pending[i].dueMs) >= 0) {
            return flushIndex(i);
        }
    }
    return false;
}

bool Esp32BaseConfig::flushNextForced() {
    for (uint8_t i = 0; i < ESP32BASE_CONFIG_PENDING_MAX; ++i) {
        if (g_pending[i].type != PENDING_EMPTY) {
            return flushIndex(i);
        }
    }
    return false;
}

bool Esp32BaseConfig::flushAll() {
    bool ok = true;
    for (uint8_t i = 0; i < ESP32BASE_CONFIG_PENDING_MAX; ++i) {
        if (g_pending[i].type != PENDING_EMPTY && !flushIndex(i)) {
            ok = false;
        }
    }
    return ok;
}

uint8_t Esp32BaseConfig::pendingCount() {
    uint8_t count = 0;
    for (uint8_t i = 0; i < ESP32BASE_CONFIG_PENDING_MAX; ++i) {
        if (g_pending[i].type != PENDING_EMPTY) {
            ++count;
        }
    }
    return count;
}

uint8_t Esp32BaseConfig::pendingCapacity() {
    return ESP32BASE_CONFIG_PENDING_MAX;
}

bool Esp32BaseConfig::clearNamespace(const char* ns) {
    if (!validName(ns)) {
        return false;
    }
    const NamespaceLookupResult lookup = lookupNamespace(ns);
    if (lookup == NamespaceLookupResult::Error) {
        return false;
    }
    if (lookup == NamespaceLookupResult::NotFound) {
        clearPendingNamespace(ns);
        return true;
    }
    Preferences prefs;
    if (!prefs.begin(ns, false)) {
        return false;
    }
    const bool ok = prefs.clear();
    prefs.end();
    if (ok) {
        clearPendingNamespace(ns);
    }
    return ok;
}

bool Esp32BaseConfig::clearWifiConfig() {
    return clearNamespace("eb_wifi");
}

bool Esp32BaseConfig::clearWebAuthConfig() {
    return clearNamespace("eb_web");
}

bool Esp32BaseConfig::clearSystemConfig() {
    return esp32base_internal::removeConfigKey("eb_sys", "hostname") !=
           esp32base_internal::ConfigKeyRemoveResult::Error;
}

bool Esp32BaseConfig::clearLogConfig() {
    return clearNamespace("eb_log");
}

bool Esp32BaseConfig::clearUiConfig() {
    return clearNamespace("eb_ui");
}

bool Esp32BaseConfig::factoryReset() {
    bool ok = true;
    ok = clearWifiConfig() && ok;
    ok = clearNamespace("eb_wifi_rcv") && ok;
    ok = clearWebAuthConfig() && ok;
    ok = clearSystemConfig() && ok;
    ok = clearLogConfig() && ok;
    ok = clearUiConfig() && ok;
    return ok;
}

bool Esp32BaseConfig::clearLibraryNamespaces() {
    return factoryReset();
}

void Esp32BaseConfig::pauseDeferredFlush() {
    g_paused = true;
}

void Esp32BaseConfig::resumeDeferredFlush() {
    g_paused = false;
}

bool Esp32BaseConfig::isDeferredFlushPaused() {
    return g_paused;
}

void Esp32BaseConfig::enableConfigAudit(bool enabled) {
    g_auditEnabled = enabled;
}

void Esp32BaseConfig::enableConfigReadAudit(bool enabled) {
    g_readAuditEnabled = enabled;
}

bool Esp32BaseConfig::isConfigAuditEnabled() {
    return g_auditEnabled;
}

bool Esp32BaseConfig::isConfigReadAuditEnabled() {
    return g_readAuditEnabled;
}
